src/InformationRegisters/ABCXYZКлассификацияНоменклатуры/ABCXYZКлассификацияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ABCXYZКлассификацияНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Класс</name>
    <type>
      <types>EnumRef.XYZКлассификация</types>
      <types>EnumRef.ABCКлассификация</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПараметраКлассификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделКлассификации</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПараметраКлассификации</name>
    <type>
      <types>EnumRef.ТипыПараметровКлассификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКлассификации</name>
    <type>
      <types>EnumRef.ТипыКлассификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыКлассификации/ТипыКлассификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКлассификации</name>
  <enumValues>
    <name>ABC</name>
  </enumValues>
  <enumValues>
    <name>XYZ</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/ABCXYZКлассификацияНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Очищает всю информацию ABC-классификаци номенклатуры.
Процедура ОчиститьABCКлассификацию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ABCXYZКлассификацияНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТипКлассификации.Установить(Перечисления.ТипыКлассификации.ABC);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Очищает всю информацию XYZ-классификаци номенклатуры.
Процедура ОчиститьXYZКлассификацию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ABCXYZКлассификацияНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТипКлассификации.Установить(Перечисления.ТипыКлассификации.XYZ);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
